/*
কোনো একটি পূর্ণসংখ্যা দেওয়া থাকলে সেটি জোড় না বিজোড় তা বের করতে হবে।

ইনপুট

প্রথম লাইনে একটি সংখ্যা T (1<=T<=100) দেওয়া থাকবে। পরবর্তীতে T সংখ্যক লাইনে একটি করে অঋণাত্বক (Non-negative) পূর্ণসংখ্যা n দেওয়া থাকবে। একটি সংখ্যায় সর্বোচ্চ 100টি অংক (digit) থাকতে পারে।

আউটপুট

প্রতিটি পূর্ণসংখ্যার জন্য, সংখ্যাটি জোড় হলে even আর বিজোড় হলে odd কথাটি প্রিন্ট করতে হবে।
*/

#include<stdio.h>

int main(){

int T;
char n[101];
scanf("%d", &T);

while(T--){
    scanf("%s", &n);
    if(n[strlen(n)-1] %2 == 0){
        printf("even\n");
    }
    else{
        printf("odd\n");
    }
}

}
