/*
তোমার হাতে যথেষ্ট পরিমাণে কাজকর্ম নেই দেখে তোমাকে একটি বাক্স আঁকার কাজ দেওয়া হলো। আসলে ব্যপারটি তেমন কিছু কঠিন নয়,
তোমাকে বর্গের একটি বাহুর দৈর্ঘ্য বলা হবে আর তুমি চট করে * অক্ষরটি ব্যবহার করে ওই বর্গটি এঁকে ফেলবে। বর্গের কেবল বাহু আঁকলেই হবে না,
 ভিতরের ঘরগুলোও * অক্ষরটি দিয়ে পূর্ণ করে দিতে হবে। যেহেতু তুমি প্রোগ্রামিং শেখা শুরু করেছ এবং লুপ পর্যন্ত শিখে ফেলেছ, তাই তুমি কাজটি করবে একটি প্রোগ্রাম লিখে।
*/

#include<stdio.h>

int main(){
int T,n,i,j;
scanf("%d" ,&T);

while(T--){
    scanf("%d" ,&n);
    for(i=1; i<=n; i++){
        for(j=1; j<=n; j++){
            printf("*");
        }
        printf("\n");
    }
}
return 0;
}
